//;******************************************************************************
//;* Copyright (c) 1983-2011, Insyde Software Corporation. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************
// *++
//
// Copyright (c) 2004, Intel Corporation
// All rights reserved. This program and the accompanying materials
// are licensed and made available under the terms and conditions of the BSD License
// which accompanies this distribution.  The full text of the license may be found at
// http://opensource.org/licenses/bsd-license.php
//
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.
//
// Module Name:
//
//   bmstring.vfr
//
// Abstract:
//
//   String definitions for Boot Maintenance Utility.
//
// Revision History:
//
// --*/
//strlang   SPA "Espa駉"

/=#

#langdef eng "English"
#langdef fra "Français"
#langdef zho "\wide中文\narrow"
#langdef jpn "\wide日本語\narrow"
#langdef ita "Italian"
#langdef spa "Spanish"
#langdef ger "German"
#langdef por "Portuguese"

#string STR_NULL_STRING                #language eng  " "
                                       #language fra  " "
#string STR_NONE                       #language eng  "NONE"
                                       #language fra  "NONE"
#string STR_FORM_MAIN_TITLE            #language eng  "Boot Maintenance Manager"
                                       #language fra  "Boot Maintenance Manager"
#string STR_FORM_BOOT_SETUP_TITLE      #language eng  "Boot Options"
                                       #language fra  "Boot Options"
#string STR_FORM_BOOT_SETUP_HELP       #language eng  "Modify system boot options"
                                       #language fra  "Modify system boot options"
#string STR_FORM_DRIVER_SETUP_TITLE    #language eng  "Driver Options"
                                       #language fra  "Driver Options"
#string STR_FORM_DRIVER_SETUP_HELP     #language eng  "Modify boot driver options"
                                       #language fra  "Modify boot driver options"
#string STR_FORM_BOOT_ADD_TITLE        #language eng  "Add Boot Option"
                                       #language fra  "Add Boot Option"
#string STR_FORM_BOOT_ADD_HELP         #language eng  "Add EFI Application or Removable Fs as Boot Option"
                                       #language fra  "Add EFI Application or Removable Fs as Boot Option"
#string STR_FORM_BOOT_DEL_TITLE        #language eng  "Delete Boot Option"
                                       #language fra  "Delete Boot Option"
#string STR_FORM_NEXT_BOOT_HELP        #language eng  "Will be valid on next boot"
                                       #language fra  "Will be valid on next boot"
#string STR_FORM_BOOT_CHG_TITLE        #language eng  "Change Boot Order"
                                       #language fra  "Change Boot Order"
#string STR_FORM_DRV_ADD_TITLE         #language eng  "Add Driver Option"
                                       #language fra  "Add Driver Option"
#string STR_FORM_DRV_ADD_HELP          #language eng  "Add .EFI Driver as Driver Option"
                                       #language fra  "Add .EFI Driver as Driver Option"
#string STR_FORM_DRV_DEL_TITLE         #language eng  "Delete Driver Option"
                                       #language fra  "Delete Driver Option"
#string STR_FORM_DRV_CHG_TITLE         #language eng  "Change Driver Order"
                                       #language fra  "Change Driver Order"
#string STR_FORM_BOOT_NEXT_TITLE       #language eng  "Set Boot Next Value"
                                       #language fra  "Set Boot Next Value"
#string STR_FORM_BOOT_NEXT_HELP        #language eng  "Modify next boot behavior"
                                       #language fra  "Modify next boot behavior"
#string STR_FORM_TIME_OUT_TITLE        #language eng  "Set Time Out Value"
                                       #language fra  "Set Time Out Value"
#string STR_FORM_TIME_OUT_HELP         #language eng  "Modify automatic boot time-out value"
                                       #language fra  "Modify automatic boot time-out value"
#string STR_FORM_CON_MAIN_TITLE        #language eng  "Console Options"
                                       #language fra  "Console Options"
#string STR_FORM_CON_MAIN_HELP         #language eng  "Modify system console options"
                                       #language fra  "Modify system console options"
#string STR_FORM_CON_IN_TITLE          #language eng  "Console Input Device Select"
                                       #language fra  "Console Input Device Select"
#string STR_FORM_CON_IN_HELP           #language eng  "Enable console device as ConIn"
                                       #language fra  "Enable console device as ConIn"
#string STR_FORM_SET_FD_ORDER_TITLE    #language eng  "Set Legacy Floppy Drive Order"
                                       #language fra  "Set Legacy Floppy Drive Order"
#string STR_FORM_SET_HD_ORDER_TITLE    #language eng  "Set Legacy HardDisk Drive Order"
                                       #language fra  "Set Legacy HardDisk Drive Order"
#string STR_FORM_SET_CD_ORDER_TITLE    #language eng  "Set Legacy CD-ROM Drive Order"
                                       #language fra  "Set Legacy CD-ROM Drive Order"
#string STR_FORM_SET_NET_ORDER_TITLE   #language eng  "Set Legacy NET Drive Order"
                                       #language fra  "Set Legacy NET Drive Order"
#string STR_FORM_SET_BEV_ORDER_TITLE   #language eng  "Set Legacy BEV Drive Order"
                                       #language fra  "Set Legacy BEV Drive Order"
#string STR_FORM_GOTO_SETTING          #language eng  "Go Back To Setting Page"
                                       #language fra  "Go Back To Setting Page"
#string STR_COM1                       #language eng  "COM1"
                                       #language fra  "COM1"
#string STR_COM2                       #language eng  "COM2"
                                       #language fra  "COM2"
#string STR_COM_AS_CONSOLE_OPTION      #language eng  "Select this COM port as Console"
                                       #language fra  "Select this COM port as Console"
#string STR_FORM_CON_OUT_TITLE         #language eng  "Console Output Device Select"
                                       #language fra  "Console Output Device Select"
#string STR_FORM_CON_OUT_HELP          #language eng  "Enable console device as ConOut"
                                       #language fra  "Enable console device as ConOut"
#string STR_FORM_STD_ERR_TITLE         #language eng  "Console Standard Error Device Select"
                                       #language fra  "Console Standard Error Device Select"
#string STR_FORM_STD_ERR_HELP          #language eng  "Enable console device as StdErr"
                                       #language fra  "Enable console device as StdErr"
#string STR_FORM_COM_TITLE             #language eng  "COM Attribute Setup Page"
                                       #language fra  "COM Attribute Setup Page"
#string STR_FORM_COM_HELP              #language eng  "Setup ComPort BaudRate, DataBits, StopBits, Parity and TerminalType"
                                       #language fra  "Setup ComPort BaudRate, DataBits, StopBits, Parity and TerminalType"
#string STR_FORM_DRV_ADD_FILE_TITLE    #language eng  "Add Driver Option Using File"
                                       #language fra  "Add Driver Option Using File"
#string STR_FORM_DRV_ADD_HANDLE_TITLE  #language eng  "Add Driver Option Using Handle"
                                       #language fra  "Add Driver Option Using Handle"
#string STR_FORM_BOOT_ADD_DESC_TITLE   #language eng  "Modify Boot Option Description"
                                       #language fra  "Modify Boot Option Description"
#string STR_FORM_DRV_ADD_DESC_TITLE    #language eng  "Modify Driver Option Description"
                                       #language fra  "Modify Driver Option Description"
#string STR_NUM_AUTO_BOOT              #language eng  "Auto Boot Time-out"
                                       #language fra  "Auto Boot Time-out"
#string STR_HLP_AUTO_BOOT              #language eng  "Range: 0 to 65535 seconds, 0 means no wait, 65535 means waiting for key"
                                       #language fra  "Range: 0 to 65535 seconds, 0 means no wait, 65535 means waiting for key"
#string STR_BOOT_NEXT                  #language eng  "Boot Next Value"
                                       #language fra  "Boot Next Value"
#string STR_BOOT_NEXT_HELP             #language eng  "Next boot use this boot option"
                                       #language fra  "Next boot use this boot option"
#string STR_LOAD_OPTION_DEVPATH        #language eng  "This is the devicepath"
                                       #language fra  "This is the devicepath"
#string STR_LOAD_OPTION_DESC           #language eng  "Input the description"
                                       #language fra  "Input the description"
#string STR_LOAD_OPTION_ACTIVE         #language eng  "Load Option Active"
                                       #language fra  "Load Option Active"
#string STR_LOAD_OPTION_FORCE_RECON    #language eng  "Load Option Force Reconnect"
                                       #language fra  "Load Option Force Reconnect"
#string STR_SAVE_AND_EXIT              #language eng  "Apply Changes"
                                       #language fra  "Apply Changes"
#string STR_NO_SAVE_AND_EXIT           #language eng  "Discard Changes"
                                       #language fra  "Discard Changes"
#string STR_CON_IN_SETUP               #language eng  "Set Console Input Device"
                                       #language fra  "Set Console Input Device"
#string STR_CON_OUT_SETUP              #language eng  "Set Console Output Device"
                                       #language fra  "Set Console Output Device"
#string STR_CON_ERR_SETUP              #language eng  "Set Error Output Device"
                                       #language fra  "Set Error Output Device"
#string STR_CON_COM_SETUP              #language eng  "Set COM Attributes"
                                       #language fra  "Set COM Attributes"
#string STR_COM_TERMI_TYPE             #language eng  "Set COM Terminal Type"
                                       #language fra  "Set COM Terminal Type"
#string STR_COM_BAUD_RATE              #language eng  "Set COM Baud Rate"
                                       #language fra  "Set COM Baud Rate"
#string STR_COM_DATA_BITS              #language eng  "Set COM Data Bits"
                                       #language fra  "Set COM Data Bits"
#string STR_COM_PARITY                 #language eng  "Set COM Parity"
                                       #language fra  "Set COM Parity"
#string STR_COM_STOP_BITS              #language eng  "Set COM Stop Bits"
                                       #language fra  "Set COM Stop Bits"
#string STR_COM_BAUD_RATE_0            #language eng  "115200"
                                       #language fra  "115200"
#string STR_COM_BAUD_RATE_1            #language eng  "57600"
                                       #language fra  "57600"
#string STR_COM_BAUD_RATE_2            #language eng  "38400"
                                       #language fra  "38400"
#string STR_COM_BAUD_RATE_3            #language eng  "19200"
                                       #language fra  "19200"
#string STR_COM_BAUD_RATE_4            #language eng  "9600"
                                       #language fra  "9600"
#string STR_COM_BAUD_RATE_5            #language eng  "7200"
                                       #language fra  "7200"
#string STR_COM_BAUD_RATE_6            #language eng  "4800"
                                       #language fra  "4800"
#string STR_COM_BAUD_RATE_7            #language eng  "3600"
                                       #language fra  "3600"
#string STR_COM_BAUD_RATE_8            #language eng  "2400"
                                       #language fra  "2400"
#string STR_COM_BAUD_RATE_9            #language eng  "2000"
                                       #language fra  "2000"
#string STR_COM_BAUD_RATE_10           #language eng  "1800"
                                       #language fra  "1800"
#string STR_COM_BAUD_RATE_11           #language eng  "1200"
                                       #language fra  "1200"
#string STR_COM_BAUD_RATE_12           #language eng  "600"
                                       #language fra  "600"
#string STR_COM_BAUD_RATE_13           #language eng  "300"
                                       #language fra  "300"
#string STR_COM_BAUD_RATE_14           #language eng  "150"
                                       #language fra  "150"
#string STR_COM_BAUD_RATE_15           #language eng  "134"
                                       #language fra  "134"
#string STR_COM_BAUD_RATE_16           #language eng  "110"
                                       #language fra  "110"
#string STR_COM_BAUD_RATE_17           #language eng  "75"
                                       #language fra  "75"
#string STR_COM_BAUD_RATE_18           #language eng  "50"
                                       #language fra  "50"
#string STR_COM_DATA_BITS_0            #language eng  "5"
                                       #language fra  "5"
#string STR_COM_DATA_BITS_1            #language eng  "6"
                                       #language fra  "6"
#string STR_COM_DATA_BITS_2            #language eng  "7"
                                       #language fra  "7"
#string STR_COM_DATA_BITS_3            #language eng  "8"
                                       #language fra  "8"
#string STR_COM_PAR_0                  #language eng  "None"
                                       #language fra  "None"
#string STR_COM_PAR_1                  #language eng  "Even"
                                       #language fra  "Even"
#string STR_COM_PAR_2                  #language eng  "Odd"
                                       #language fra  "Odd"
#string STR_COM_PAR_3                  #language eng  "Mark"
                                       #language fra  "Mark"
#string STR_COM_PAR_4                  #language eng  "Space"
                                       #language fra  "Space"
#string STR_COM_STOP_BITS_0            #language eng  "One"
                                       #language fra  "One"
#string STR_COM_STOP_BITS_1            #language eng  "One And A Half"
                                       #language fra  "One And A Half"
#string STR_COM_STOP_BITS_2            #language eng  "Two"
                                       #language fra  "Two"
#string STR_COM_TYPE_0                 #language eng  "PC_ANSI"
                                       #language fra  "PC_ANSI"
#string STR_COM_TYPE_1                 #language eng  "VT_100"
                                       #language fra  "VT_100"
#string STR_COM_TYPE_2                 #language eng  "VT_100_PLUS"
                                       #language fra  "VT_100_PLUS"
#string STR_COM_TYPE_3                 #language eng  "VT_UTF8"
                                       #language fra  "VT_UTF8"
#string STR_RESET                      #language eng  "Reset System"
                                       #language fra  "Reset System"
#string STR_FORM_GOTO_MAIN             #language eng  "Go Back To Main Page"
                                       #language fra  "Go Back To Main Page"
#string STR_BOOT_FROM_FILE             #language eng  "Boot From File"
                                       #language fra  "Boot From File"
#string STR_BOOT_FROM_FILE_HELP        #language eng  "Boot system from a file or device"
                                       #language fra  "Boot system from a file or device"
#string STR_OPTIONAL_DATA              #language eng  "Input Optional Data"
                                       #language fra  "Input Optional Data"
#string STR_CHANGE_ORDER               #language eng  "Change the order"
                                       #language fra  "Change the order"
#string STR_BOOT_LEGACY                #language eng  "Boot Legacy System"
                                       #language fra  "Boot Legacy System"
#string STR_BOOT_LEGACY_HELP           #language eng  "Supports boot from legacy FD, HD, CD, PCMCIA, USB, and Network"
                                       #language fra  "Supports boot from legacy FD, HD, CD, PCMCIA, USB, and Network"
#string STR_BOOT_LEGACY_FLOPPY         #language eng  "Boot From Floppy"
                                       #language fra  "Boot From Floppy"
#string STR_BOOT_LEGACY_HARDDRIVE      #language eng  "Boot From Hard Drive"
                                       #language fra  "Boot From Hard Drive"
#string STR_BOOT_LEGACY_CDROM          #language eng  "Boot From CD Rom"
                                       #language fra  "Boot From CD Rom"
#string STR_BOOT_LEGACY_PCMCIA         #language eng  "Boot From PCMCIA"
                                       #language fra  "Boot From PCMCIA"
#string STR_BOOT_LEGACY_USB            #language eng  "Boot From USB Device"
                                       #language fra  "Boot From USB Device"
#string STR_BOOT_LEGACY_NETWORK        #language eng  "Boot From Network"
                                       #language fra  "Boot From Network"
#string STR_DISABLE_LEGACY_DEVICE      #language eng  "Disabled"
                                       #language fra  "Disabled"
#string STR_FILE_EXPLORER_TITLE        #language eng  "File Explorer"
                                       #language fra  "File Explorer"


//
// BugBug : need someone to translate these strings to french
//
